Revit 2024 API
StructuralConnectionHandler.GetInputPoint Method
 Returns point with specified id. Returns null if specified point does not exist
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public ConnectionInputPoint GetInputPoint(
	Guid id
)
Visual Basic
Public Function GetInputPoint ( _
	id As Guid _
) As ConnectionInputPoint
Visual C++
public:
ConnectionInputPoint^ GetInputPoint(
	Guid id
)
Parameters
id
Type: System.Guid
See Also
StructuralConnectionHandler Class
Autodesk.Revit.DB.Structure Namespace